performance-test-reports/automated-security-tests/12609649575/1/user-login/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2025-01-04T10:21:35Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  98% — ✓ 333863 / ✗ 6752
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 2098
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 1398
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3256

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 333863 / ✗ 6752
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  98% — ✓ 333863 / ✗ 6752
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6752    7.644678/s
-    _response_success_cnt..........: 333863  378.002851/s
-    _response_total_cnt............: 340615  385.647529/s
-    checks.........................: 99.33%  ✓ 4033364     ✗ 27008 
-    data_received..................: 119 MB  135 kB/s
-    data_sent......................: 80 MB   90 kB/s
-    dropped_iterations.............: 1621414 1835.780289/s
-    group_duration.................: avg=905.95ms min=238.35µs med=2.33ms   max=1m0s     p(90)=1.27s    p(95)=2.49s   
-    http_req_blocked...............: avg=461.97ms min=0s       med=174.2µs  max=19.71s   p(90)=1.02s    p(95)=2.05s   
-    http_req_connecting............: avg=461.92ms min=0s       med=134.84µs max=19.71s   p(90)=1.02s    p(95)=2.05s   
-  ✗ http_req_duration..............: avg=1.22s    min=0s       med=247.29ms max=1m0s     p(90)=748.52ms p(95)=1.5s    
-      { expected_response:true }...: avg=522.07ms min=853.5µs  med=246.96ms max=58.32s   p(90)=656.14ms p(95)=1.2s    
-  ✗ http_req_failed................: 1.98%   ✓ 6752        ✗ 333863
-    http_req_receiving.............: avg=448.47µs min=0s       med=78.97µs  max=179.12ms p(90)=1.02ms   p(95)=1.84ms  
-    http_req_sending...............: avg=166.65µs min=0s       med=33.69µs  max=189.21ms p(90)=151.05µs p(95)=284.16µs
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=1.22s    min=0s       med=246.75ms max=1m0s     p(90)=747.26ms p(95)=1.5s    
-    http_reqs......................: 340615  385.647529/s
-    iteration_duration.............: avg=1.81s    min=3.1ms    med=254.48ms max=1m0s     p(90)=2.49s    p(95)=5.24s   
-    iterations.....................: 340615  385.647529/s
-    vus............................: 1       min=0         max=1000
-    vus_max........................: 1000    min=379       max=1000